Revit 2027 API
ExternalDataManagerCommands.BuiltInExternalDataManagerCommands.Add Property
 Add new external data.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalDataManagerCommandId Add { get; }
Public Shared ReadOnly Property Add As ExternalDataManagerCommandId
	Get
public:
static property ExternalDataManagerCommandId^ Add {
	ExternalDataManagerCommandId^ get ();
}
static member Add : ExternalDataManagerCommandId with get
Property Value
ExternalDataManagerCommandId
See Also
Reference
ExternalDataManagerCommands.BuiltInExternalDataManagerCommands Class
Autodesk.Revit.UI Namespace